{"/intro/":{"data":{"":"👋 Hello! Welcome to the OOPSpam documentation!","next#Next":"Dive right into the following section to get started:\nOOPSpam API ↗Integrate custom solutions with the OOPSpam API. WordPressComprehensive guide to the OOPSpam WordPress plugin. Other integrationsIncorporate OOPSpam into Zapier, Make, or Bubble.io workflows. ReportTrain OOPSpam to adapt to your specific use case. ","questions-or-feedback#Questions or Feedback?":" ❓ Have a question or feedback? Feel free to reach out! ","what-is-oopspam#What is OOPSpam?":"OOPSpam is a comprehensive anti-spam and abuse protection service that uses machine learning and advanced filtering to safeguard your website from malicious submissions in forms, comments, and other inputs. Its adaptable system ensures robust protection and a seamless user experience.\nKey Features:\nMachine Learning Spam and Abuse Detection: Automatically detects and blocks spam and abusive content using intelligent content analysis. Massive Database: Leverages an up-to-date database of malicious IP addresses and emails. Geo-Blocking: Block unwanted submissions from specific countries to prevent region-based spam and abuse. Language-Based Blocking: Filter and block submissions based on message language. Disposable Email Blocking: Prevents submissions from temporary or disposable email addresses. Adaptable System: Easily customizable to meet your unique spam and abuse protection needs. "},"title":"Introduction"},"/other-integrations/":{"data":{"":"OOPSpam offers seamless integrations with popular automation platforms, allowing you to efficiently block spam across your entire workflow. Official Integrations:\nZapier Make (formerly Integromat) Bubble.io These integrations provide a simple way to incorporate OOPSpam’s powerful spam detection capabilities into your automated processes, such as lead generation, user sign-ups, and content moderation.","next#Next":"Dive right into the following section to get started:\nOOPSpam API ↗Integrate custom solutions with the OOPSpam API. WordPressComprehensive guide to the OOPSpam WordPress plugin. Other integrationsIncorporate OOPSpam into Zapier, Make, or Bubble.io workflows. ReportTrain OOPSpam to adapt to your specific use case. "},"title":"Other integrations"},"/other-integrations/bubble-io/":{"data":{"":"OOPSpam Bubble plugin can be used to block spam registration and contact form submissions. Here is an example how you can use the plugin to stop spam on your Bubble contact forms.\nCheck out How to set up OOPSpam with Bubble.io app article for more information.\nTo report false positives and false negatives, see the reporting documentation.","next#Next":"Dive right into the following section to get started:\nOOPSpam API ↗Integrate custom solutions with the OOPSpam API. WordPressComprehensive guide to the OOPSpam WordPress plugin. Other integrationsIncorporate OOPSpam into Zapier, Make, or Bubble.io workflows. ReportTrain OOPSpam to adapt to your specific use case. "},"title":"Bubble.io"},"/other-integrations/make/":{"data":{"":"","#":"Make is a visual automation platform that lets you send information between OOPSpam API and thousands of apps with just a few clicks. All you have to do is drop OOPSpam Make App to your scenario and enter API key.\nLet’s look at the following example.\nOn this scenario, we add and connect Contact Form 7, OOPSpam Anti-Spam and Airtable apps.\nContact Form 7 app receives form submissions and passes data to OOPSpam app. OOPSpam analyzes and passes the spam score to the filter between OOPSpam and Airtable app. Filter allows data to be passed to Airtable app only if the spam score is less than 3. Airtable receives data and insert it to a spreadsheet. ✅ Done! Every contact form, comment, email and chat apps on Make can be connect in similar fashion.\nTo report false positives and false negatives, see the reporting documentation.\nRelated blog posts: Stop Spam on Elementor Forms Using Make and OOPSpam Stop Spam on Breakdance Forms Using Make and OOPSpam ","next#Next":"Dive right into the following section to get started:\nOOPSpam API ↗Integrate custom solutions with the OOPSpam API. WordPressComprehensive guide to the OOPSpam WordPress plugin. Other integrationsIncorporate OOPSpam into Zapier, Make, or Bubble.io workflows. ReportTrain OOPSpam to adapt to your specific use case. "},"title":"Make"},"/other-integrations/zapier/":{"data":{"":"","#":"Connect OOPSpam to hundreds of other apps with Zapier Zapier lets you connect OOPSpam to 6,000+ other web services. Automated connections called Zaps, set up in minutes with no coding, can automate your day-to-day tasks and build workflows between apps that otherwise wouldn’t be possible.\nEach Zap has one or more Triggers, where your information comes from and which causes OOPSpam Check for Spam Action in OOPSpam.\nGetting Started with Zapier Sign up for a free Zapier account, from there you can jump right in.\nHow do I connect OOPSpam to Zapier? Log in to your Zapier account or create a new account. Navigate to “My Apps” from the top menu bar. Now click on “Connect a new account…” and search for “OOPSpam” Use your credentials to connect your OOPSpam account to Zapier. Once that’s done you can start creating an automation! Use a pre-made Zap or create your own with the Zap Editor. Creating a Zap requires no coding knowledge and you’ll be walked step-by-step through the setup. Need inspiration? See everything that’s possible with OOPSpam and Zapier. If you have any additional questions, you can open a ticket with Zapier Support from https://zapier.com/OOPSpam/get-help or contact OOPSpam support via contact@oopspam.com.\nFalse positive and false negative reporting To report false positives and false negatives, see the reporting documentation.\nRelated blog posts: Stop spam on Webflow contact forms using Zapier and OOPSpam Stop spam on Netlify Forms using Zapier and OOPSpam Stop spam on HubSpot contact forms using Zapier and OOPSpam Stop spam on Typeform using Zapier and OOPSpam ","next#Next":"Dive right into the following section to get started:\nOOPSpam API ↗Integrate custom solutions with the OOPSpam API. WordPressComprehensive guide to the OOPSpam WordPress plugin. Other integrationsIncorporate OOPSpam into Zapier, Make, or Bubble.io workflows. ReportTrain OOPSpam to adapt to your specific use case. "},"title":"Zapier"},"/report/":{"data":{"":"The OOPSpam API takes an optimistic approach and avoids blocking messages unless it’s confident they are spam. However, false positives (legitimate messages marked as spam) and false negatives (spam messages marked as legitimate) can still occur. There are various reasons for false positives and false negatives, such as:\nIP addresses previously used for spamming but now in different hands, retaining a bad reputation. Messages incorrectly flagged To minimize these occurrences, it’s essential to train the OOPSpam API’s standard model with the specific spam and non-spam (ham) messages you’re receiving. This process will improve the model’s accuracy over time, reducing false positives and false negatives.","next#Next":"Dive right into the following section to get started:\nOOPSpam API ↗Integrate custom solutions with the OOPSpam API. WordPressComprehensive guide to the OOPSpam WordPress plugin. Other integrationsIncorporate OOPSpam into Zapier, Make, or Bubble.io workflows. ReportTrain OOPSpam to adapt to your specific use case. ","reporting-false-positives-and-false-negatives#Reporting False Positives and False Negatives":"Depending on the plugin (or the API) you’re using, there are several ways to report false positives and false negatives to the OOPSpam model:\nAPI The API users, should use the Report endpoint to report any false positives and false negatives. The status of the reported items can be viewed at the Reported page in the OOPSpam Dashboard.\nℹ️ To report via the OOPSpam Dashboard, add the logIt parameter in the request body to view and report requests on the Logs page. WordPress Use the Form Spam Entries and Form Ham Entries tables to report false positives and false negatives.\nZapier, Make.com, Bubble.io Set the Log submissions to OOPSpam setting to true. For Bubble.io, set logIt to true in the request body.\nThis will enable you to view and report all submissions on the Logs page in the OOPSpam dashboard. Click Flag as spam or Flag as ham to flag an entry as a false positive or false negative, respectively.\nThe flagged items will be available under the Reported page."},"title":"Reporting"},"/wordpress/":{"data":{"":"","how-oopspam-protects-your-website#How OOPSpam Protects Your Website":"When a visitor submits your contact or comment form, the OOPSpam plugin instantly springs into action:\nSubmission Analysis: The plugin uses three key elements:\nIP address Email address Message content Spam Detection: Using advanced algorithms, OOPSpam checks for patterns and characteristics typically associated with spam.\nInstant Decision: If spam is detected, the plugin immediately:\nMarks the submission as spam Blocks it from reaching your inbox Protection: This process effectively:\nShields your website from potential threats Keeps your inbox clean and manageable By automating spam detection, OOPSpam allows you to focus on genuine messages and maintain a secure online presence.\nSupported Contact Form Builders The following contact form solutions are supported by the OOPSpam plugin:\nWooCommerce Order \u0026 Registration Elementor Forms Ninja Forms Gravity Forms Kadence Form Block Fluent Forms Breakdance Forms WS Form WPDiscuz Forminator WPForms Formidable Forms Contact Form 7 Bricks Forms Toolset Forms Piotnet Forms GiveWP Donation Forms MailPoet See the plugin description on the WordPress plugin directory for more.","installation#Installation":"Installing the OOPSpam WordPress plugin is easy and can be done through your website’s WordPress dashboard. Follow these steps to install the plugin on your website:\nStep 1 Log in to the WordPress admin panel.\nStep 2 Go to the Plugins section and select “Add New”.\nStep 3 Search for “oopspam”.\nStep 4 Click on the “Install Now” button and then “Activate”.\n✅ Done After the plugin is installed and activated, you can enable spam protection for your contact forms under OOPSpam Anti-Spam -\u003e Settings.\nBe sure to check out the Configuration page for more information on different settings and how to configure the plugin.","introduction#Introduction":"The OOPSpam plugin for WordPress integrates with the the OOPSpam API to protect your website’s comment system, registration, and major contact form builders from spam.","next#Next":"Dive right into the following section to get started:\nOOPSpam API ↗Integrate custom solutions with the OOPSpam API. WordPressComprehensive guide to the OOPSpam WordPress plugin. Other integrationsIncorporate OOPSpam into Zapier, Make, or Bubble.io workflows. ReportTrain OOPSpam to adapt to your specific use case. "},"title":"WordPress"},"/wordpress/configuration/":{"data":{"":"","#":"Quick set up The OOPSpam WordPress plugin requires minimal configuration to function properly. Once the initial setup is complete, all management can be handled through the WordPress dashboard.\nTo get started quickly, follow these steps:\nRegister on the OOPSpam Dashboard and copy the API key. Paste the key into the “My API Key” field in the OOPSpam WordPress Settings. Select “OOPSpam Dashboard” from the “I got my API Key from” setting. Ensure that the “Activate Spam Protection” option is checked for the contact form plugin you are using. Spam protection for comments is enabled by default. ℹ️ The Sensitivity Level setting in the OOPSpam plugin controls how aggressively the plugin checks submissions for spam. The default setting is 3, which is a balance between catching spam and avoiding false positives (legitimate submissions marked as spam). We recommend using the ‘Moderation’ option for the Sensitivity Level setting. This balanced option typically provides the best combination of spam detection accuracy and minimal false positives for most users.. However, if you believe that the default setting is not a good fit for your website, please reach out to our support team for assistance. Contact form specific settings When a supported contact form builder is installed, the OOPSpam WordPress plugin will automatically detect it and display relevant settings. For example, if the plugin detects that you have installed the Elementor Page Builder, it will display specific settings for Elementor Forms.\nWe see three settings here:\nActivate Spam Protection Elementor Form Spam Message The main content field ID (optional) Let’s look at each setting in details.\nActivate Spam Protection: Enables spam filtering for this specific contact form plugin.\nElementor Form Spam Message: Displays an error message when spam is detected. This can happen when legitimate users are unable to submit the form. You can use this setting to provide a custom message to guide them to an alternative way to contact you, such as through email. It also allows you to hide your actual email address and only display it to legitimate visitors.\nThe main content field ID (optional): The OOPSpam plugin detects spam not only based on IP and email, but also by analyzing the message content submitted through forms. By default, the plugin only captures the content of the first message field. If your form includes multiple message fields (textarea fields), the plugin will only analyze the first one. However, using this setting, you can specify which textarea field the OOPSpam plugin should analyze for spam.\nTo do so, you need to enter Field ID. It’s under Advanced tab of a textarea field in your Elementor Forms.\nSimilar to Elementor Forms, all contact form plugins have a Field ID that can be copied and pasted into this setting field, allowing the OOPSpam plugin to identify which field’s content should be analyzed for spam.\nPrevent form submissions by country and language The OOPSpam WordPress plugin offers two methods to prevent unwanted submissions, by filtering based on the country of origin and the language of the message.\nAllow messages only from these countries: This setting allows you to specify which countries you want to allow submissions from. By adding countries here, you can quickly limit submissions to only those countries, while still keeping your website accessible worldwide.\nBlock messages from these countries: This setting allows you to specify which countries you want to block submissions from.\nAllow messages only in these languages: If your contact form includes a message field, you can use this filter to only allow submissions written in specific languages. This is another way to limit the submissions you receive through your contact form.\nManually block email, IP, keyword The plugin automatically spam checks every form submission, registration, comment with the OOPSpam API. But sometimes you may want to quickly block email, IP address or a keyword in the message. To block manually you can use the Manual Moderation tab in the plugin settings.\nAdd the email, IP address or keyword to the appropriate field in the `Manual Moderation’ tab. Add one item per line.\nPrivacy settings We are committed to providing our customers with the best possible privacy options. To effectively detect spam, OOPSpam only needs a minimal amount of data. When a user submits a comment or contact form, the plugin collects the user’s IP address, email, and message content. It then sends this information to the OOPSpam API for spam detection.\n⚠️ The OOPSpam plugin does not store any personal data that is submitted through the APIs. All data is stored in your local WordPress database.\nIf you encounter any false positive or false negatives, you have the option to submit them to us for review. This allows the system to improve itself based on your report and the data will be deleted within a week.\nHere we have three settings:\nDo not analyze IP addresses: When this setting is enabled, the plugin will not send the IP address of a submission to our servers for spam detection.\nDo not analyze Email addresses: When this setting is enabled, the plugin will not send the email address of a submission to our servers for spam detection.\nRemove sensitive information from messages: When this setting is enabled, the plugin will attempt to detect and remove any personal information such as email addresses, street addresses, phone numbers, and first and last names from the message. It is important to note, however, that there is no guarantee that all personal information will be accurately removed.\nAdditional settings There are additional settings that you may find useful:\nMove spam comments to: By default, the OOPSpam plugin will move a spam comment to the Spam folder in Comments. You can change this setting to move it to the Trash folder instead. Consider short messages as spam: Many spam messages are too short to be a meaningful sentence. This setting allows you to catch this type of spam. The OOPSpam WordPress plugin also includes two additional menus: Form Spam Entries and Form Ham Entries. These menus allow you to view and manage the submissions that the plugin has identified as spam or legitimate messages (ham).\nEmpty “Form Spam Entries” table every: Allows you to set an interval for automatically removing all entries in the Form Spam Entries table. This table holds all the spam submissions to your website. The default interval is set to one month. Empty “Form Ham Entries” table every: Allows you to set an interval for automatically removing all entries in the Form Ham Entries table. This table holds all the legitimate submissions (non-spam) to your website. The default interval is set to one month. ℹ️ Check Logs to learn more about these tables. "},"title":"Configuration"},"/wordpress/form-entries/":{"data":{"":"","logs-in-the-oopspam-dashboard#Logs in the OOPSpam Dashboard":"Logs in the WordPress Dashboard When you enable spam protection for your contact forms, every submission will be stored in one of two places: the Form Ham Entries or the Form Spam Entries.\nThe Form Ham Entries table stores all submissions that were not detected as spam. The Form Spam Entries table stores all submissions that were detected as spam. You can use these tables to review and report any misdetected entries to us, which will help OOPSpam improve its spam detection capabilities and better meet the specific needs of your website.\nTo report a falsely flagged entry to OOPSpam:\nGo to the Form Spam Entries or Form Ham Entries table in the OOPSpam plugin settings in your WordPress dashboard. Hover over the entry you want to report. Click on the “Not Spam” link for a submission that was incorrectly marked as spam, or the “Spam” link for a submission that was incorrectly marked as legitimate. The page will refresh, and the status of the entry will update to “Reported as not spam” or “Reported as spam”. By default, both the Form Ham Entries and Form Spam Entries tables will be emptied automatically once every month. This helps keep the size of the tables manageable and does not affect the performance of the OOPSpam plugin or the accuracy of the spam detection.\nYou can change the interval at which the tables are cleared by using the Empty “Form Spam Entries” table every and Empty “Form Ham Entries” table every settings in the OOPSpam plugin settings in your WordPress dashboard.\nLogs in the OOPSpam Dashboard You can also view these reported entries on the OOPSpam Dashboard under the “Reported” section. This allows you to easily track and review all reported entries, and help OOPSpam improve its spam detection algorithms.\nEntries that are reported and reviewed in the OOPSpam Dashboard will be removed within a week once they are resolved.","logs-in-the-wordpress-dashboard#Logs in the WordPress Dashboard":""},"title":"Logs"},"/wordpress/hooks/":{"data":{"":"The plugins comes with two hooks:\nHook Purpose oopspam_check_for_spam Overwrite spam filtering. Add your custom logic. oopspam_woo_disable_honeypot Disable honeypot for WooCommerce integration ","adding-custom-spam-rule#Adding custom spam rule":"You can overwrite spam filtering in the OOPSpam WordPress plugin using the oopspam_check_for_spam filter and return a score based on your own logic.\nIn some cases where you can use it:\nAllow and block certain IPs Allow and block certain emails Block based on some keywords and more. In your theme’s functions.php file or anywhere else, add the following code:\nadd_filter('oopspam_check_for_spam', 'mycustom_spam_check', 10, 3); function mycustom_spam_check($message, $ip, $email) { // Your custom logic // Return 0 for ham/not spam or 6 for spam. return 6; } The returned value can be any value from 0 to 6.\nWe recommend keeping it simple and returning 0 for not spam, and 6 for spam entries.","disable-honeypot-in-woocommerce#Disable Honeypot in WooCommerce":"While honeypot protection helps block bots, it may also block users using password managers or similar browser extensions to autofill forms. To prevent this, you can disable the honeypot and rely on IP and email reputation to assess spam risk.\nTo disable the honeypot, add the following code to the functions.php file or elsewhere in your theme:\nadd_filter('oopspam_woo_disable_honeypot', '__return_true'); "},"title":"Hooks"},"/wordpress/multisite/":{"data":{"basic-configuration#Basic Configuration":"Add your API key to enable spam protection:\ndefine( 'OOPSPAM_API_KEY', 'YOUR_KEY' ); ","example-configuration#Example Configuration":"Here’s a complete example of how to configure multiple forms in your wp-config.php:\n// OOPSpam Configuration define( 'OOPSPAM_API_KEY', 'your-api-key-here' ); define( 'OOPSPAM_IS_CF7_ACTIVATED', true ); define( 'OOPSPAM_IS_WOO_ACTIVATED', true ); define( 'OOPSPAM_IS_WPREGISTER_ACTIVATED', true ); ","form-integration-settings#Form Integration Settings":"Enable spam filtering for specific form types by adding these definitions to your wp-config.php. Set to true to enable or false to disable.\nPopular Form Plugins Contact Form 7: define( 'OOPSPAM_IS_CF7_ACTIVATED', true ); WPForms: define( 'OOPSPAM_IS_WPF_ACTIVATED', true ); Gravity Forms: define( 'OOPSPAM_IS_GF_ACTIVATED', true ); Ninja Forms: define( 'OOPSPAM_IS_NJ_ACTIVATED', true ); Page Builder Forms Elementor Pro: define( 'OOPSPAM_IS_EL_ACTIVATED', true ); Beaver Builder: define( 'OOPSPAM_IS_BB_ACTIVATED', true ); Bricks Builder: define( 'OOPSPAM_IS_BR_ACTIVATED', true ); Kadence Blocks: define( 'OOPSPAM_IS_KB_ACTIVATED', true ); Membership \u0026 eCommerce WooCommerce: define( 'OOPSPAM_IS_WOO_ACTIVATED', true ); MemberPress: define( 'OOPSPAM_IS_MPRESS_ACTIVATED', true ); Paid Memberships Pro: define( 'OOPSPAM_IS_PMP_ACTIVATED', true ); Ultimate Member: define( 'OOPSPAM_IS_UMEMBER_ACTIVATED', true ); Newsletter \u0026 Marketing MailChimp for WP: define( 'OOPSPAM_IS_MC4WP_ACTIVATED', true ); MailPoet: define( 'OOPSPAM_IS_MPOET_ACTIVATED', true ); Other Supported Forms Jetpack Forms: define( 'OOPSPAM_IS_JFORM_ACTIVATED', true ); SureForms: define( 'OOPSPAM_IS_SURE_ACTIVATED', true ); WordPress Registration: define( 'OOPSPAM_IS_WPREGISTER_ACTIVATED', true ); GiveWP Donation: define( 'OOPSPAM_IS_GIVE_ACTIVATED', true ); Fluent Forms: define( 'OOPSPAM_IS_FF_ACTIVATED', true ); WS Form: define( 'OOPSPAM_IS_WS_ACTIVATED', true ); Formidable: define( 'OOPSPAM_IS_FABLE_ACTIVATED', true ); Toolset Forms: define( 'OOPSPAM_IS_TS_ACTIVATED', true ); Piotnet Forms: define( 'OOPSPAM_IS_PIONET_ACTIVATED', true ); wpDiscuz Comments: define( 'OOPSPAM_IS_WPDIS_ACTIVATED', true ); Forminator: define( 'OOPSPAM_IS_FORMINATOR_ACTIVATED', true ); ","oopspam-wordpress-multisite-configuration#OOPSpam WordPress Multisite Configuration":"OOPSpam WordPress Multisite ConfigurationThe OOPSpam WordPress plugin fully supports multisite environments. This guide explains how to configure the plugin globally using your wp-config.php file."},"title":"Multisite / Network"},"/wordpress/testing/":{"data":{"":"After installing and configuring OOPSpam, test your contact form or comments by using one of the blocked email addresses or the message listed in the table below. Upon submission, you should expect to receive an error message.\nmessage Email Good day, My name is Eric and unlike a lot of emails you might get, I wanted to instead provide you with a word of encouragement – Congratulations\\r\\n\\r\\nWhat for? \\r\\n\\r\\nPart of my job is to check out websites and the work you’ve done with pos-cash.de definitely stands out. \\r\\n\\r\\nIt’s clear you took building a website seriously and made a real investment of time and resources into making it top quality.\\r\\n\\r\\nThere is, however, a catch… more accurately, a question…\\r\\n\\r\\nSo when someone like me happens to find your site – maybe at the top of the search results (nice job BTW) or just through a random link, how do you know? testing@example.com, test@test.com "},"title":"Testing"},"/wordpress/troubleshooting/":{"data":{"":"","#":"If your question about this or any other topic is not answered here, please reach out to our support team for assistance. We are always happy to help.\nForm submissions on my WordPress websites are being flagged as spam. If your form has a textarea field (usually this field is used for longer form fields like message) and it is not a required field (or can be less than 20 characters) in your form then make sure you uncheck the “Consider short messages as spam” setting in the OOPSpam WordPress plugin settings. This setting will prevent form submissions if a textarea field in your form is too short to be considered a meaningful sentence.\nAnother setting to pay attention to is the sensitivity level setting. Make sure it is set to recommended level 3.\nIf all the above settings are configured correctly, please use Form Spam Entries to report false positives. The system will quickly adapt to your use case and you will likely not have this issue.\nI’m a paid customer but I see warning about API limit If you’re experiencing an API limit warning on your WordPress dashboard, please follow these steps to resolve the issue:\nConfirm that you have a valid API key. Make sure that you have registered on the OOPSpam Dashboard and copied the key. Paste the API key into My API Key in the OOPSpam WordPress Settings. Select OOPSpam Dashboard from I got my API Key from Check Activate Spam Protection for the contact form plugin you have. Wait for the first form or comment submission to come in. The API usage numbers will be updated with each submission and the warning will be removed. "},"title":"Troubleshooting"}}